#ตอนที่ 20 - Slice Array 2 มิติ

import numpy as np

#เข้าถึงสมาชิกโดยใช้งาน Slice
arr1 = np.array([[1,2,3],[4,5,6],[7,8,9]])
#โครงสร้างในการที่เราจะเข้าถึง
#arr1[start,stop,step,start,stop,step]
#arr1[:,:] โดยที่มีเครื่องหมาย , ขั้นตรงกลาง

#แสดงค่าในอาเรย์เเบบทุกตัว
print(arr1[:,:])

#แสดงค่าในอาเรย์เเถว index 1 เริ่มจาก index 1 เป็นต้นไป
print(arr1[1:,1:])

#แสดงค่าในอาเรย์เเถว index 2 เริ่มจาก index 2 เป็นต้นไป
print(arr1[2:,2:])


#แสดงค่าในอาเรย์เเถว index 0 เริ่มจาก index 2 เป็นต้นไป
print(arr1[0:,2:])

#แสดงค่าในอาเรย์เเถว index 1 เริ่มจาก index 0 เป็นต้นไป
print(arr1[1:,:])


#แสดงค่าในอาเรย์เเถว index 0 ถึงเเถวที่ 2
print(arr1[:2,:])

#แสดงค่าในอาเรย์เเถว index 0 ถึงเเถวที่ 2 เเละ เอา  index ที่ 2
print(arr1[:2,2:])

#แสดงค่าในอาเรย์เเถว index 1 ถึงเเถวที่ 2 เเละ เอาในช่วง คอลัมน์ ช่วง index 1 ถึง 2
print(arr1[1:2,1:2])

#ใช้งานตัว start stop step เข้าร่วมด้วย
print(arr1[:,:])

#เอาในช่วงเเถวที่ 1 เเละ 2 โดยที่เลือกเอาสมาชิกทุกตัว
print(arr1[::2,:])

#เอาในช่วง index ที่ 1 โดยที่เลือกเอาสมาชิกทุกตัว
print(arr1[1:2,:])

#เอาในช่วงindex(คอลัมน์) 0 & 2 โดยที่เอาในเเถวทุกๆเเถว
print(arr1[::,::2])

#เอาในช่วงindex(คอลัมน์) ทุกตัว เเละ เอาในเเถว index ที่ 1 ไม่เกิน 2
print(arr1[::,1:2])